alice_in_wonderland = ''' 
"Would you tell me, please, which way I ought to go from here?"
"That depends a good deal on where you want to get to" said the Cat.
"I don\'t much care where ——" said Alice.
"Then it doesn\'t matter which way you go," said the Cat.
"—— so long as I get somewhere," Alice added as an explanation.
"Oh, you\'re sure to do that,"said the Cat, "if you only walk long enough."'''
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
print("______________________________\ntasks 01 - 03:\n", alice_in_wonderland)

# """
#     # Задачі 04 -10:
#     # Переведіть задачі з книги "Математика, 5 клас"
#     # на мову пітон і виведіть відповідь, так, щоб було
#     # зрозуміло дитині, що навчається в п'ятому класі
# """
# task 04
# """
# Площа Чорного моря становить 436 402 км2, а площа Азовського
# моря становить 37 800 км2. Яку площу займають Чорне та Азов-
# ське моря разом?
# """
print("""______________________________\ntask 04:\n""")
s_azov_sea = 37800
s_black_sea = 436402
print(f"Площа Чорного моря становить {s_black_sea}км2, а площа Азовського "
      f"моря становить {s_azov_sea}км2. Разом вони займають площу {s_black_sea + s_azov_sea}км²")

# """
# Мережа супермаркетів має 3 склади, де всього розміщено
# 375 291 товар. На першому та другому складах перебуває
# 250 449 товарів. На другому та третьому – 222 950 товарів.
# Знайдіть кількість товарів, що розміщені на кожному складі.
# """
total_items = 375291
ab = 250449
bc = 222950

b = ab + bc - total_items
a = ab - b
c = bc - b
assert a + b + c == total_items, "Не вірне рівняння"
print("""______________________________\ntask 05:\n""")
print(f'Мережа супермаркетів має 3 склади, де всього розміщено '
      f'{total_items} товар. На першому та другому складах перебуває '
      f'{ab} товарів. \nНа другому та третьому – {bc} товарів. '
      f'Тоді на першому складі {a} товарів, на другому {b}, і на третьому {c}')
# task 06
print("""______________________________\ntask 06:\n""")
# """
# Михайло разом з батьками вирішили купити комп’ютер, ско-
# риставшись послугою «Оплата частинами». Відомо, що сплачу-
# вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
# вартість комп’ютера.
# """
year = 12
per_mount = 1179
print(f"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по {per_mount} грн/місяць. Вартість компʼютера складатиме {int(per_mount * 1.5 * year)}грн.
""")
# task 07
print("""______________________________\ntask 07:\n""")
# """
# Знайди остачу від діленя чисел:
# a) 8019 : 8     d) 7248 : 6
# b) 9907 : 9     e) 7128 : 5
# c) 2789 : 5     f) 19224 : 9
# """
print(f'''
a) {8019 % 8}
b) {9907 % 9}
c) {2789 % 5}
d) {7248 % 6}
e) {7128 % 5}
f) {19224 % 9}''')
# task 08
print("""______________________________\ntask 08:\n""")
# """
# Іринка, готуючись до свого дня народження, склала список того,
# що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
# для даного її замовлення.
# Назва товару    Кількість   Ціна
# Піца велика     4           274 грн
# Піца середня    2           218 грн
# Сік             4           35 грн
# Торт            1           350 грн
# Вода            3           21 грн
# """
# Кількість та ціна товарів
pizza_big_price = 274
pizza_medium_price = 218
juice_price = 35
cake_price = 350
water_price = 21

print(
    f"""Іринці для завмовлення знадобиться {pizza_big_price * 4 + pizza_medium_price * 2 + juice_price * 4 + cake_price + water_price * 3}грн """)
# task 09
print("""______________________________\ntask 09:\n""")
# """
# Ігор займається фотографією. Він вирішив зібрати всі свої 232
# фотографії та вклеїти в альбом. На одній сторінці може бути
# розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
# Ігорю, щоб вклеїти всі фото?
# """
print(f'''Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Ігорю знадобиться {int(232 / 8)} сторінок,
щоб вклеїти всі фото.''')

# task 10
print("""______________________________\nfinal task:\n""")
# """
# Родина зібралася в автомобільну подорож із Харкова в Буда-
# пешт. Відстань між цими містами становить 1600 км. Відомо,
# що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
# становить 48 літрів.
# 1) Скільки літрів бензину знадобиться для такої подорожі?
# 2) Скільки щонайменше разів родині необхідно заїхати на зап-
# равку під час цієї подорожі, кожного разу заправляючи пов-
# ний бак?
# """
distance = 1600
fuel_consumption = 9
tank = 48

print(f"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить {distance} км. Відомо,
що на кожні 100 км необхідно {fuel_consumption} літрів бензину. Місткість баку
становить {tank} літрів.
1)  Для такої подорожі знадобиться {(total_fuel := int(distance / 100 * fuel_consumption))} літри бензину.
2) Родині необхідно заїхати на заправку під час цієї подорожі щонайменше {int(total_fuel/tank)} рази, 
кожного разу заправляючи повний бак.""")
